org/giving_presentations_in_roam.org
#+setupfile: ./hugo_setup.org
#+hugo_slug: giving_presentations_in_roam
#+TITLE: giving presentations in roam
* To give a presentation, focus on the first block and then use the `Ctrl-c Ctrl-m` shortcut to flip to the next block.
** https://twitter.com/RoamResearch/status/1233107556525981696?s=20
* If you need to zoom in to get to the level of a list of blocks that are atomic enough to serve as slides or to cycle through individual bullet points, just click on the first entry in the lower level and then proceed using the `Ctrl-c Ctrl-m` shortcut
* When you need to zoom out, just click on the appropriate breadcrumb at the top
* If you are at the leaf of a tree, the keyboard shortcut will not work. If you are within a list and you arrive at the final item, `Ctrl-c Ctrl-m` will cycle back to the first item. At that point, you can click the breadcrumb for the higher level heading, collapse it, and move to the next header.
